app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 4)

INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "This should have a user."], ["user_id", 1], ["created_at", "2015-08-22 10:02:12.809630"], ["updated_at", "2015-08-22 10:02:12.809630"]]
---
  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save

DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]
---
  def destroy
    @pin.destroy

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_pin
      @pin = Pin.find(params[:id])